phygeonet-master/case3/TemplateCase-0.05/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.491505 -0.245109 0.005)
(-0.471443 -0.245109 0.005)
(-0.451382 -0.245109 0.005)
(-0.431321 -0.245109 0.005)
(-0.411259 -0.245109 0.005)
(-0.391198 -0.245109 0.005)
(-0.371136 -0.245109 0.005)
(-0.351075 -0.245109 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.501534 -0.245114 0.005)
(-0.504597 -0.23534 0.005)
(-0.507644 -0.225562 0.005)
(-0.510664 -0.215775 0.005)
(-0.513648 -0.205977 0.005)
(-0.516584 -0.196165 0.005)
(-0.519462 -0.186335 0.005)
(-0.522272 -0.176486 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.501534 -0.245114 0.005)
(0.504597 -0.23534 0.005)
(0.507644 -0.225562 0.005)
(0.510664 -0.215775 0.005)
(0.513648 -0.205977 0.005)
(0.516584 -0.196165 0.005)
(0.519462 -0.186335 0.005)
(0.522272 -0.176486 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
